In [1]:
import pandas as pd
import numpy as np
from numpy import nan as NA

# if want to generate null value np.nan

s1 = pd.Series([1,2,3,4,5,np.nan])

In [2]:
s1

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    NaN
dtype: float64

In [3]:
s1.isnull()

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [4]:
# for finding null only

s1[s1.isnull()]

5   NaN
dtype: float64

In [5]:
s1.notnull()

0     True
1     True
2     True
3     True
4     True
5    False
dtype: bool

In [6]:
# for finding not null values

s1[s1.notnull()]

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [7]:
# remove no

a = s1[s1.notnull()]
a

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [11]:
s1.dropna(inplace=True) # srf yahin pe update karega , yeh na values ko drop karega

In [12]:
s1

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [20]:
#in pandas agar memory mein hi koi cheez update karwani he tou phr usko aap inplace use kaarke use karian

In [15]:
from numpy import nan as NA
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])

In [19]:
data.dropna() # agar is ko row mein aik bhi NA nazar aiga tou woh poori row delete kargdega tou ham koi threshol define karsakty hein jo isko handle kar sakay

     0    1    2
0  1.0  6.5  3.0

In [18]:
# threshold = 5 means 5 values honi chaiyen , means threshold vallues ko dekhega, NA ko nahi dekhe ga

In [21]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [22]:
data.dropna(how='any')

     0    1    2
0  1.0  6.5  3.0

In [23]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA

In [26]:
df.fillna(0)

          0         1         2
0 -1.619638  0.000000  0.000000
1 -0.845819  0.000000  0.000000
2 -0.685466  0.000000  1.287529
3 -1.326940  0.000000 -2.421227
4  0.105202 -0.947370  1.910266
5  0.478147  2.102353 -0.321497
6  0.606813 -0.409614  1.665383

In [25]:
df

          0         1         2
0 -1.619638       NaN       NaN
1 -0.845819       NaN       NaN
2 -0.685466       NaN  1.287529
3 -1.326940       NaN -2.421227
4  0.105202 -0.947370  1.910266
5  0.478147  2.102353 -0.321497
6  0.606813 -0.409614  1.665383

In [28]:
df.fillna({1:1,2:2})

          0         1         2
0 -1.619638  1.000000  2.000000
1 -0.845819  1.000000  2.000000
2 -0.685466  1.000000  1.287529
3 -1.326940  1.000000 -2.421227
4  0.105202 -0.947370  1.910266
5  0.478147  2.102353 -0.321497
6  0.606813 -0.409614  1.665383

In [30]:
df.mean() # 3 means aye har column k

0   -0.469672
1    0.248456
2    0.424091
dtype: float64

In [32]:
df.fillna(df.mean())

          0         1         2
0 -1.619638  0.248456  0.424091
1 -0.845819  0.248456  0.424091
2 -0.685466  0.248456  1.287529
3 -1.326940  0.248456 -2.421227
4  0.105202 -0.947370  1.910266
5  0.478147  2.102353 -0.321497
6  0.606813 -0.409614  1.665383

In [34]:
df.fillna({1:df[1].mean(),2:df[2].mean()}) # aisa srf mean mein hoga agar koi hard coded value he tou dictionary banani hogi lazmi

          0         1         2
0 -1.619638  0.248456  0.424091
1 -0.845819  0.248456  0.424091
2 -0.685466  0.248456  1.287529
3 -1.326940  0.248456 -2.421227
4  0.105202 -0.947370  1.910266
5  0.478147  2.102353 -0.321497
6  0.606813 -0.409614  1.665383

In [38]:
df.fillna(method='bfill') # backward last se start hoga

          0         1         2
0 -1.619638 -0.947370  1.287529
1 -0.845819 -0.947370  1.287529
2 -0.685466 -0.947370  1.287529
3 -1.326940 -0.947370 -2.421227
4  0.105202 -0.947370  1.910266
5  0.478147  2.102353 -0.321497
6  0.606813 -0.409614  1.665383

In [39]:
df.fillna(method='ffill')

          0         1         2
0 -1.619638       NaN       NaN
1 -0.845819       NaN       NaN
2 -0.685466       NaN  1.287529
3 -1.326940       NaN -2.421227
4  0.105202 -0.947370  1.910266
5  0.478147  2.102353 -0.321497
6  0.606813 -0.409614  1.665383

In [40]:
df

          0         1         2
0 -1.619638       NaN       NaN
1 -0.845819       NaN       NaN
2 -0.685466       NaN  1.287529
3 -1.326940       NaN -2.421227
4  0.105202 -0.947370  1.910266
5  0.478147  2.102353 -0.321497
6  0.606813 -0.409614  1.665383

In [45]:
df.fillna(method='bfill') # jo nan milega tou usmein woh last number read karke nan ki jagah fill kardega

          0         1         2
0 -1.619638 -0.947370  1.287529
1 -0.845819 -0.947370  1.287529
2 -0.685466 -0.947370  1.287529
3 -1.326940 -0.947370 -2.421227
4  0.105202 -0.947370  1.910266
5  0.478147  2.102353 -0.321497
6  0.606813 -0.409614  1.665383

In [46]:
#forward mein upar se parhay ga backward mein neechay se parhega

In [49]:
df[1][5] = NA
df

          0         1         2
0 -1.619638       NaN       NaN
1 -0.845819       NaN       NaN
2 -0.685466       NaN  1.287529
3 -1.326940       NaN -2.421227
4  0.105202 -0.947370  1.910266
5  0.478147       NaN -0.321497
6  0.606813 -0.409614  1.665383

In [48]:
df.fillna(method='ffill')

          0         1         2
0 -1.619638       NaN       NaN
1 -0.845819       NaN       NaN
2 -0.685466       NaN  1.287529
3 -1.326940       NaN -2.421227
4  0.105202 -0.947370  1.910266
5  0.478147  2.102353 -0.321497
6  0.606813 -0.409614  1.665383

In [53]:
df.fillna(method='bfill', limit =1)

          0         1         2
0 -1.619638       NaN       NaN
1 -0.845819       NaN  1.287529
2 -0.685466       NaN  1.287529
3 -1.326940 -0.947370 -2.421227
4  0.105202 -0.947370  1.910266
5  0.478147 -0.409614 -0.321497
6  0.606813 -0.409614  1.665383